---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CopyPasteOptions Members
CopyPasteOptions Class Constructors Methods Properties See Also Send Feedback
---

The CopyPasteOptions type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
|  | CopyPasteOptions | Creates a new instance of a CopyPasteOptions object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the CopyPasteOptions |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
|  | GetDuplicateTypeNamesHandler | Returns current duplicate type names handler or nullNothingnullptra null reference (Nothing in Visual Basic) if none is set. |
|  | GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object.) |
|  | SetDuplicateTypeNamesHandler | Sets a custom duplicate type names handler. If this value is not set, the default handler is used. By default, Revit displays a modal dialog with options to either copy new types only, or cancel the operation. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

CopyPasteOptions Class

Autodesk.Revit.DB Namespace